In [2]:
import pandas as pd
import numpy as np

In [3]:
sozluk1 = {"isim" : ["ahmet","mehmet","zeynep","atil"], 
           "spor": ["kosu","yuzme","kosu","basketbol"],
           "kolari" : ["123","432","435","678"]
          }

In [13]:
dframe1=pd.DataFrame(sozluk1,index =[0,1,2,3])

In [14]:
dframe1

     isim       spor kolari
0   ahmet       kosu    123
1  mehmet      yuzme    432
2  zeynep       kosu    435
3    atil  basketbol    678

In [15]:
sozluk2 ={"isim" : ["osman","levent","atlas","fatma"], 
           "spor": ["kosu","yuzme","kosu","basketbol"],
           "kolari" : ["345","567","758","254"]
          }

In [16]:
dframe2=pd.DataFrame(sozluk2,index =[4,5,6,7])

In [17]:
dframe2

     isim       spor kolari
4   osman       kosu    345
5  levent      yuzme    567
6   atlas       kosu    758
7   fatma  basketbol    254

In [18]:
sozluk3 ={"isim" : ["ayse","mahmut","duygu","nur"], 
           "spor": ["kosu","yuzme","badminton","tenis"],
           "kolari" : ["324","264","578","235"]
          }

In [19]:
dframe3 =pd.DataFrame(sozluk3,index =[8,9,10,11])

In [20]:
dframe3

      isim       spor kolari
8     ayse       kosu    324
9   mahmut      yuzme    264
10   duygu  badminton    578
11     nur      tenis    235

##concat

In [22]:
pd.concat([dframe1,dframe2,dframe3])

      isim       spor kolari
0    ahmet       kosu    123
1   mehmet      yuzme    432
2   zeynep       kosu    435
3     atil  basketbol    678
4    osman       kosu    345
5   levent      yuzme    567
6    atlas       kosu    758
7    fatma  basketbol    254
8     ayse       kosu    324
9   mahmut      yuzme    264
10   duygu  badminton    578
11     nur      tenis    235

## merge

In [23]:
msozluk1 = {"isim":["ahmet","mehmet","zeynep","atil"],
            "spor":["kosu","yuzme","kosu","basketbol"]
           }

In [24]:
mdframe1 =pd.DataFrame(msozluk1)

In [25]:
mdframe1

     isim       spor
0   ahmet       kosu
1  mehmet      yuzme
2  zeynep       kosu
3    atil  basketbol

In [26]:
msozluk2 = {"isim":["ahmet","mehmet","zeynep","atil"],
            "kolari":[100,123,234,345]
           }

In [27]:
mdframe2 =pd.DataFrame(msozluk2)

In [28]:
mdframe2

     isim  kolari
0   ahmet     100
1  mehmet     123
2  zeynep     234
3    atil     345

In [29]:
pd.merge(mdframe1,mdframe2,on="isim")

     isim       spor  kolari
0   ahmet       kosu     100
1  mehmet      yuzme     123
2  zeynep       kosu     234
3    atil  basketbol     345

In [31]:
maassozluk={"isim":["ali","mehmet","ayse","eda"],
            "departman":["yazilim","satis","pazarlama","yazilim"],
            "maas":[123,234,641,645]
           }

In [32]:
maasdata=pd.DataFrame(maassozluk)

In [33]:
maasdata

     isim  departman  maas
0     ali    yazilim   123
1  mehmet      satis   234
2    ayse  pazarlama   641
3     eda    yazilim   645

In [36]:
maasdata["departman"].unique()

array(['yazilim', 'satis', 'pazarlama'], dtype=object)

In [37]:
maasdata["departman"].nunique()

3

In [38]:
maasdata["departman"].value_counts()

yazilim      2
satis        1
pazarlama    1
Name: departman, dtype: int64

In [43]:
def fonksiyon(maas):
    return maas * 0.31

In [44]:
maasdata["maas"].apply(fonksiyon)

0     38.13
1     72.54
2    198.71
3    199.95
Name: maas, dtype: float64

In [45]:
maasdata.isnull()

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [52]:
yeniveri={"karakter sinifi":["south park","south park","simpson","simpson","simpson"],
          "karakter ismi":["cartman","kenny","homer","bart","bart"],
          "karakter yas":[9,10,50,20,20]
         }

In [53]:
yenidata=pd.DataFrame(yeniveri)

In [57]:
yenidata

  karakter sinifi karakter ismi  karakter yas
0      south park       cartman             9
1      south park         kenny            10
2         simpson         homer            50
3         simpson          bart            20
4         simpson          bart            20

In [56]:
yenidata.pivot_table(values="karakter yas",index=["karakter sinifi","karakter ismi"])

                               karakter yas
karakter sinifi karakter ismi
simpson         bart                     20
                homer                    50
south park      cartman                   9
                kenny                    10

In [58]:
yenidata.pivot_table(values="karakter yas",index=["karakter sinifi","karakter ismi"],aggfunc=np.sum)

                               karakter yas
karakter sinifi karakter ismi
simpson         bart                     40
                homer                    50
south park      cartman                   9
                kenny                    10